import type { PreviewPostContent } from '../previewTypes';
import { PREVIEW_AUTHORS } from '../previewAuthors';

/** 명상 또 명상 (2026-05-22) */
export const post: PreviewPostContent = {
  id: '6b419b0f-7da5-41e2-b8f4-2979a418fcbf',
  title: '명상 또 명상 ',
  body: "<p>돌아 왔습니다. 자기 관리 주제가 나올 때 마다 n 회째 들고 오는 명상 입니다. </p><p>사람의 인지 스탯에는 지능과 지혜가 있다고 생각합니다. 어려서부터 rpg 게임을 좋아했기에 게임 능력치에 빗대어 생각하는게 습관이 되어 버렸습니다. </p><p>보통 지능은 마법 데미지를 높여주고 지혜는 마나 수치 자체를 높여주는 것이 일반적인 rpg 게임의 해석 입니다. 하지만, 저는 현실에서는 좀 다르게 정의 합니다. </p><p>지능은 뚫고 나가는 힘 입니다. 지혜는 내가 어디 있는지 아는 힘 입니다. 삶이라는 시공간에서 '나' 라는 존재를 원하는 좌표로 옮겨 가기 위해서는 둘간의 조화가 몹시 중요합니다. 어디로 가는지 모르고 빠르게 간다면 우주의 미아가 되어 버릴 것이고, 정확한 방향으로 거의 욺직이지 않는다면 제자리일 것이기 때문입니다.  </p><p>대한민국 같은 사회에서는 특히 성인이 되기 이전에는 지능이 몹시 중요합니다. 어느 방향으로 가는지 내가 어디 있는지 사실 크게 중요하지 않습니다. 사회에서 정해놓은 방향이 있고 그 방향으로 가기만 하면 됩니다. 일단 남들이 가라는 대로 빨리 달리기만 하면 어떻게든 인정을 받습니다. </p><p>어른이 되고 나서 부터는 상황이 꽤 많이 달라집니다. 어디로 가야할지 스스로 선택해야 하는 일들이 많아지고, 어디로 가야할지 알기 위해서는 내가 어디 있는지 알아야 합니다. 이때 눈과 귀를 막고 여전히 남들이 말하는 방향만 보고 뛰는 사람들도 있지만, 제가 보기에는 재밌는 인생 같지는 않습니다. </p><p>지혜가 필요합니다. 어떻게 빨리 가는지에 대해서는 AI가 가장 잘 알것입니다. 고 지능자와 저 지능자의 차이는 급속도로 줄어들 것입니다. 인간을 인간답게 하는것은 지혜에 있지 않을까 생각합니다. </p><p>공부는 지능 스탯을 올리는데 도움이 됩니다. 지혜스탯을 올리는데는 무엇이 도움 될까요? 맞습니다. 명상 입니다. </p><p>명상을하며 가만히 있을때 뇌는 DMN(default mode network) 상태로 들어간다고 합니다. DMN 상태는 성찰의 상태 입니다. 지금의 상태를 돌아보고 정리하는 일을 하도록 위대한 자연이 우리에게 심어놓은 기능입니다. 그만큼 우리 인생에 중요한 기능이라는 것이겠지요. </p><p>자랑이지만, 저는 명상을 많이 합니다. 별로 똑똑한 사람은 아니지만 꽤 지혜로운 결정을 인생에서 많이 내려 왔다고 자부합니다. 명상이 지혜스탯을 키워준 탓이 크다고 생각합니다.</p><p>명상 하다가 말았던 분들이 많이 계실텐데, 오늘 생각나신 김에 한번만 더 해보지 않으시렵니까?</p><p></p><p></p><p></p><p></p><p></p><p></p>",
  contentPreview:
    '돌아 왔습니다. 자기 관리 주제가 나올 때 마다 n 회째 들고 오는 명상 입니다. 사람의 인지 스탯에는 지능과 지혜가 있다고 생각합니다. 어려서부터 rpg 게임을 좋아했기에 게임 능력치에 빗대어 생각하는게 습관이 되어 버렸습니다. 보통 지능은 마법 데미지를 높여주고 지혜는 마나 수치 자체를 높여주는 것이 일반적인 rpg 게임의 해석 입니다. 하지만, 저는',
  author: PREVIEW_AUTHORS['pv-author-6'],
  createdAt: '2026-05-22T16:24:13.76+00:00',
  thumbnailImageURL: null,
  weekDaysFromFirstDay: null,
  comments: [
    {
      id: '89610bf7-7c64-4cd0-9f10-bd55b4e556fc',
      author: PREVIEW_AUTHORS['pv-author-3'],
      body: "> 지능은 뚫고 나가는 힘 입니다. 지혜는 내가 어디 있는지 아는 힘 입니다. 삶이라는 시공간에서 '나' 라는 존재를 원하는 좌표로 옮겨 가기 위해서는 둘간의 조화가 몹시 중요합니다\n\n우왕 이 멋진 말은 어디서 얻은 인사이트인가요?! 명상을 하면 이런 통찰력이 생기는 것인가 영업당해버리는 멋진 글이네요",
      createdAt: '2026-05-23T13:15:53.949+00:00',
      replies: [
        {
          id: 'c37f5898-27e5-489e-9926-bc81779261b7',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '상대성이론 컨텐츠를 감상하다 떠오른 생각이긴 합니다',
          createdAt: '2026-05-23T14:34:32.039+00:00',
        },
        {
          id: '1878cedc-ffe3-4904-9640-6b1a7fe72826',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '명상도 효과가 분명히 있었을 것 같습니다',
          createdAt: '2026-05-23T14:35:17.321+00:00',
        },
      ],
    },
    {
      id: 'f0cbc062-31f8-44e3-8bf3-74e16c9cf7cd',
      author: PREVIEW_AUTHORS['pv-author-2'],
      body: '> 공부는 지능 스탯을 올리는데 도움이 됩니다. 지혜스탯을 올리는데는 무엇이 도움 될까요? 맞습니다. 명상 입니다.\nㅋㅋㅋ 빠져든다...',
      createdAt: '2026-05-25T13:43:29.101+00:00',
      replies: [
        {
          id: '0f4bb2ae-6dce-4866-ab90-a4238f8e6b1a',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '명상 애호가 파이팅',
          createdAt: '2026-05-26T12:10:38.495+00:00',
        },
      ],
    },
    {
      id: '5b788e5b-e0fe-4d50-bc0c-d0fbf1b1b214',
      author: PREVIEW_AUTHORS['pv-author-20'],
      body: '와.. 지능과 지혜로 명상까지..! 바로 10분 명상하러 갑니다!!',
      createdAt: '2026-05-25T15:11:38.038+00:00',
      replies: [
        {
          id: 'a91da577-b892-4245-babf-3c098e7dae90',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '좋습니다!',
          createdAt: '2026-05-26T12:10:50.973+00:00',
        },
      ],
    },
    {
      id: '6a9f5b33-9aaf-460c-b8a7-3282ce59a014',
      author: PREVIEW_AUTHORS['pv-author-23'],
      body: '> 명상 하다가 말았던 분들이 많이 계실텐데, 오늘 생각나신 김에 한번만 더 해보지 않으시렵니까?\n네에!!!!!!!!!!!!!!!!!!',
      createdAt: '2026-05-25T22:59:38.134+00:00',
      replies: [
        {
          id: '7bdf70d5-3221-406f-acdc-dcf23fed3667',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '아자잣',
          createdAt: '2026-05-26T12:10:59.197+00:00',
        },
      ],
    },
    {
      id: '6e54056d-2b26-4b8f-81e1-a2fbb8acf18b',
      author: PREVIEW_AUTHORS['pv-author-4'],
      body: '> 자랑이지만, 저는 명상을 많이 합니다\n멋진 자랑...',
      createdAt: '2026-05-26T01:07:48.148+00:00',
      replies: [
        {
          id: '43546d6b-c0d4-486d-9763-33cd9bdf1d27',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '자랑할게 많이 없지만 이건 좀 자랑스럽습니다 ㅎㅎ ',
          createdAt: '2026-05-26T12:11:20.66+00:00',
        },
      ],
    },
    {
      id: 'ad04b98e-633e-4745-9127-8ecc88e0f068',
      author: PREVIEW_AUTHORS['pv-author-11'],
      body: '멋진 글이네요!!',
      createdAt: '2026-05-27T03:48:26.862+00:00',
      replies: [
        {
          id: '5f75d909-877a-4ddc-9850-a7e83b03d812',
          author: PREVIEW_AUTHORS['pv-author-6'],
          body: '감사합니다 ㅎㅎㅎ',
          createdAt: '2026-05-27T04:40:44.271+00:00',
        },
      ],
    },
  ],
};
