import type { PreviewPostContent } from '../previewTypes';
import { PREVIEW_AUTHORS } from '../previewAuthors';

/** 암흑물질을 아십니까? (도를 아십니까 톤으로) (2026-06-10) */
export const post: PreviewPostContent = {
  id: 'f45bc229-9ccb-4b65-aa68-8183bdaf4f89',
  title: '암흑물질을 아십니까? (도를 아십니까 톤으로)',
  body: "<p> '암흑물질'에 대해 들어보셨나요? 나름 교양과학 서적이나 영상에서 단골로 나오는 소재라, 어렴풋이 들어보신 분들도 계실 것 같습니다. 진짜로 뭔가 까만 물질이 우주에 둥둥 떠다니는 건 아니구요. 대~충 간단 버전으로 설명해보겠습니다. </p><p>19세기 말부터 천문학자들은 은하를 관측하고, 그 밝기를 바탕으로 '은하의 질량은 이런 식으로 분포할거야~'라고 식을 세웠습니다. 은하의 질량은 보통 별처럼 빛을 내는 것들로 이뤄져 있으니까요, 밝기를 제대로 측정하면 거기에 별이 얼마나 있는지 알 수 있거든요. 그 질량식에서 다시 '은하에 있는 별들은 이런 식으로 회전할거야~'하는 운동식을 도출할 수 있는데요. 20세기 중후반이 되면 본격적으로 문제가 발생하기 시작합니다. 실제로 은하를 구성하는 별들의 회전 속도를 관측해봤더니, 천문학자들이 세워놓은 운동식이랑 맞아떨어지지 않았던 겁니다. 그러니 우리가 관측하는 질량과 관측하는 속도 사이에 무언가가 불일치하는... (심각한!) 문제가 발생한 것입니다. </p><p> 그리하여... 천문학자들은 '대충 우리가 관측하지 못하는 질량이 은하에 더 있다고 하자!'하고 퉁쳐버렸습니다. 우리가 관측을 못하니까 'dark matter'라고 명명해버리자~한 것입니다. 근데 더 큰 문제이자 축복(?)은요, 그렇게 그냥 우리가 관측하지 못하는 무언가가 있을 거라고 퉁쳐버리면 천문학의 많은 문제들이 뾰로롱~ 해결되는 겁니다. 이 눈덩이는 점점 불어나서요, 오늘날 천문학계에서 표준적으로 받아들여지는 우주론 모형까지 암흑물질 가정을 필수적으로 포함합니다. 이름하여 '람다-CDM 모델' ... 그렇습니다. 여기서 CDM은 무려 cold dark matter의 준말입니다. </p><p> 이번 학기에 수강한 천체물리학개론 수업에서는 어제 종강하기 전까지 몇 주 동안 우주론을 배웠습니다. 도대체 정체가 뭔지 아무도 모르는 '암흑물질'이라는 놈이 매 수업시간마다 여러 차례 언급되었구요. 우주론 배우기 전까지 중력이니 역학이니 할 때보다 훨씬 재밌긴 했는데요. 한편으로 점점 공포스러워졌습니다. ㅋㅋ 만약에요. 암흑물질이 존재하는데 우리가 아직 우리의 기술로는 관측을 못 하는 것이 아니라... 우리가 서 있는 이 이론 체계가 원점부터 잘못된 거라면 어떡하죠? 암흑물질 가정을 넣어 우주론까지 만들어놓고 몇십년을 그 가정 하에서 연구해왔는데요, 실은 우리의 이론 전체가 잘못된 거라면요? 그러면 천문학자들은 뒷감당을 어떻게 할 생각인거지!!!!! 하면서 바들바들 떨었습니다. </p><p> </p><p>아무튼 그렇습니다. 근래에는 시험공부를 하며 이런 헛된 걱정만 했습니다. 어차피 저는 졸업하면 천문학은 영~ 굿바이니까요. 남은 문제는 천문학자들이 알아서 어떻게든 해주겠죠? ㅋㅋㅋ 내일은 기말 시험이 두 개나 있는 날입니다. 피곤해서 나가떨어지지 않고 무사히 시험을 끝낼 수 있길!!!</p>",
  contentPreview:
    "'암흑물질'에 대해 들어보셨나요? 나름 교양과학 서적이나 영상에서 단골로 나오는 소재라, 어렴풋이 들어보신 분들도 계실 것 같습니다. 진짜로 뭔가 까만 물질이 우주에 둥둥 떠다니는 건 아니구요. 대~충 간단 버전으로 설명해보겠습니다. 19세기 말부터 천문학자들은 은하를 관측하고, 그 밝기를 바탕으로 '은하의 질량은 이런 식으로 분포할거야~'라고 식을",
  author: PREVIEW_AUTHORS['pv-author-16'],
  createdAt: '2026-06-10T14:28:42.258+00:00',
  thumbnailImageURL: null,
  weekDaysFromFirstDay: null,
  comments: [
    {
      id: '7ca1b81c-fd8d-4814-a300-d78382bef69a',
      author: PREVIEW_AUTHORS['pv-author-4'],
      body: '아니 관측 못하는 물질인데 그냥 다들 묻고 더블 한다구요,,,,? ',
      createdAt: '2026-06-10T15:29:54.272+00:00',
      replies: [
        {
          id: 'a4f1cbe6-a09c-4003-a9b4-edd71af43b49',
          author: PREVIEW_AUTHORS['pv-author-16'],
          body: "ㅋㅋㅋㅋㅋㅋㅋㅋ 도대체 이 상황을 어떻게 설명해야 할지 몰랐는데 '묻고 더블로 간다'는 너무나 적절한 표현이 있었네요",
          createdAt: '2026-06-11T13:39:07.825+00:00',
        },
      ],
    },
    {
      id: 'f0abb841-384e-416e-889a-e785b2b8dbc6',
      author: PREVIEW_AUTHORS['pv-author-5'],
      body: '와.. 천문학을 공부하려면 그정도 상상력과 깡다구와 광기는 있어야하나바여',
      createdAt: '2026-06-10T22:08:28.235+00:00',
      replies: [],
    },
    {
      id: '29fd574c-f3c5-43e7-bcb6-b052f62de475',
      author: PREVIEW_AUTHORS['pv-author-6'],
      body: '아인슈타인 이전까지는 시간은 변하지 않는 무언가 였지만 상대적으로 흐르는 무언가로 바뀐것 처럼 중요한 근본 원리가 바뀌는 일이 몇백년에 한번씩 일어나는 곳인거 같습니다. ',
      createdAt: '2026-06-10T23:36:24.891+00:00',
      replies: [
        {
          id: '4c4e945e-ccd8-4523-9469-064c0c5303cc',
          author: PREVIEW_AUTHORS['pv-author-16'],
          body: '토마스 쿤의 과학혁명의 구조 읽어보셨나요? 쿤의 주장과 굉장히 유사한 아이디어인 것 같아요!!!! ㅋㅋㅋㅋ',
          createdAt: '2026-06-11T13:39:59.306+00:00',
        },
      ],
    },
    {
      id: 'c7617007-1c31-423c-9682-3c1b7c7cd9b3',
      author: PREVIEW_AUTHORS['pv-author-9'],
      body: '역시 뭐든 가끔 흐린눈이 너무 필요하쥬😄',
      createdAt: '2026-06-11T00:26:28.698+00:00',
      replies: [],
    },
  ],
};
