import type { PreviewPostContent } from '../previewTypes';
import { PREVIEW_AUTHORS } from '../previewAuthors';

/** "You just need someone to be brave for." (2026-05-08) */
export const post: PreviewPostContent = {
  id: '17e4a8d1-ee3e-42ef-8464-72295f1741d5',
  title: '"You just need someone to be brave for."',
  body: "<ul><li><p>'프로젝트 헤일메리'를 보고 왔습니다. 정말 오랜만에 영화관에 갔는데요. 오후 휴가를 내고 가족 독서모임에 가는 길에 시간이 좀 남았습니다. 마침 오늘 동생이 독서모임에서 발표하는 주제가 헤일메리라길래, 그럼 한번 보고 갈까? 해서 혼자 영화관에 갔습니다. 오전 1시의 조용한 영화관과 아이맥스의 몰입감이 정말 좋았고, 무엇보다 역시 프로젝트 헤일메리는 기대한만큼 재미있었습니다. (저는 원래 소설의 팬입니다.) 극장에서 보는 게 이런 맛이구나 새삼 다시 느꼈습니다.</p></li><li><p>영화를 보고나서 특히 여운이 오래 남았던 대화를 하나 얘기해보려 합니다.</p></li></ul><p></p><p>-- (스포주의) --</p><p></p><ul><li><p>이 영화는 '과학 미스터리' '우주 어드벤쳐' '외계인과의 우정'도 있지만요. 이번에 저에게 가장 눈에 띄었던 주제는 '용기(brave)'였습니다.</p></li><li><p>주인공인 그레이스는 초반에 정말 용기가 없는 사람입니다. 그는 항상 도망쳐왔죠. 학계에서 비주류 의견을 내다가 퇴출당했지만, 사실 자기가 도망친 겁니다. 본인을 루저, 멍청이라고 자주 표현하는데 자기 스스로도 그걸 알고 있기 때문이죠. 그는 세상을 구한 임무에 참여하면서도 계속해서 중요한 순간에 용기를 내지 못한다.</p></li><li><p>그레이스는 죽을 각오를 하고 헤일메리 미션을 받는 조종사 야오에게 이렇게 말한다.</p></li><li><p>\"저라면 정말 못했을 거예요. 정말 용기를 타고 나셨네요.\"</p></li><li><p>야오는 태연하게 이렇게 대답합니다. 그리고 반드시 죽게 되는 미션을 진행하러 유유히 걸어가죠.</p></li></ul><p></p><blockquote><p><em>Anyone can be brave. You just need someone to be brave for</em>.</p></blockquote><p></p><p></p><ul><li><p>용기는 타고나는 것이 아니다. 그저 내가 용감해져야할 이유가 되는 '누군가'가 있기 때문이라는 거죠.</p></li><li><p>'용감해져야하는 누군가'가 누굴까? 결국 소중한 사람, '가족'이 떠오릅니다.</p></li><li><p>그레이스는 가족이 없습니다. 용감해져야할 누군가가 없습니다.</p></li><li><p>결국 모험 중에 가족 같은 '록키'를 만나게 됩니다. (심지어 '록키'는 그가 학계에서 퇴출당하게 만든 이론의 증명체이기도 합니다.)</p></li><li><p>그와의 관계를 통해서 정말로 용감한 행동들을 하게 됩니다. 록키에게 '너는 정말 용감해'라는 말을 듣게 되죠. 마지막 영화 결말은 정말 그레이스가 '용감해져야하하는 누군가'를 갖고 나면 얼마나 용감해질 수 있는지를 보여줍니다.</p></li></ul><p></p><ul><li><p>저는 영화를 보고 나오면서 그런 생각이 들었습니다. 나에게는 '용기를 내야하는 누군가'가 있을까? 역시나 그건 아내와 부모님, 가족인 거 같습니다. 내가 갑자기 제 3세계 범죄 소굴에 들어가야한다고 하면 절대 그런 용기가 나지 않겠지만, 거기에 아내나 가족이 갇혀있다고 하면 무조건 가게 될 거 같거든요.</p></li><li><p>예전에는 저는 세상의 많은 잘못된 일이나 악순환이 '무지'에서 비롯된다고 생각했었는데요. 요즘에는 '용기'가 없기 때문이라는 생각을 합니다.</p></li><li><p>사실 답은 꽤 클리어한 경우가 많습니다. 클리어하다는 게 쉽다는 얘기는 전혀 아니죠. 정답이 클리어한데도 쉽지 않은 이유. 대부분 그 정답이 항상 상당한 '용기'를 요구하기 때문입니다. 지식보다 용기가 훨씬 희소한 것 같아요.</p></li><li><p>지금 내가 있는 곳을 바꿔야할 용기, 내가 믿고 있는 것을 의심해야할 용기, 남들에게 인정받는 것을 포기해야할 용기 등.</p></li><li><p>하지만 어떤 사람들은 그런 용기있는 행동을 실제로 하죠. 그런데 그러기 위해선 내가 특별히 타고난 용감한 사람이 될 필요가 있거나, 슈퍼 히어로의 능력을 타고나야하는 게 아니라, 그 용기를 내야할 이유가 필요하다는 것. 이게 꽤나 인상적으로 머리에 박혔습니다.</p></li><li><p>저는 예전에 가족이 생기면 내가 더 용기있는 행동, 도전을 못하게 되는 거라고 생각했는데요. 오히려 지금은, 가족이 생겼기에 더 용기있을 수 있다는 생각도 듭니다. 어차피 정해진 이유도 없는 이 세상에 결국 '소중한 누군가'는 내가 용기를 낼 수 있게 만들어주는 가장 중요한 이유이니까요.</p></li><li><p>마침 오늘 가족에 대해 쓰는 날이라고 하니, 더 저 대사가 와닿았네요.</p></li><li><p>여러분은 'someone to be brave for' 가 있으신가요?</p></li></ul><p></p>",
  contentPreview:
    "'프로젝트 헤일메리'를 보고 왔습니다. 정말 오랜만에 영화관에 갔는데요. 오후 휴가를 내고 가족 독서모임에 가는 길에 시간이 좀 남았습니다. 마침 오늘 동생이 독서모임에서 발표하는 주제가 헤일메리라길래, 그럼 한번 보고 갈까? 해서 혼자 영화관에 갔습니다. 오전 1시의 조용한 영화관과 아이맥스의 몰입감이 정말 좋았고, 무엇보다 역시 프로젝트 헤일메리는",
  author: PREVIEW_AUTHORS['pv-author-2'],
  createdAt: '2026-05-08T14:49:37.832+00:00',
  thumbnailImageURL: null,
  weekDaysFromFirstDay: null,
  comments: [
    {
      id: 'a809d63d-2bf2-412e-ace4-154ea0b86e31',
      author: PREVIEW_AUTHORS['pv-author-6'],
      body: '완전 공감. 감탄문.',
      createdAt: '2026-05-08T23:50:58.642+00:00',
      replies: [],
    },
    {
      id: '17f0332b-7fae-4d12-9408-94290d7b457a',
      author: PREVIEW_AUTHORS['pv-author-3'],
      body: '이 글 amaze amaze amaze\n\n> 저는 예전에 가족이 생기면 내가 더 용기있는 행동, 도전을 못하게 되는 거라고 생각했는데요. 오히려 지금은, 가족이 생겼기에 더 용기있을 수 있다는 생각도 듭니다.\n\n우왁… 감탄하면서 읽었어요… 용기에 대하여 뜬구름 잡는 이야기가 아니라 와닿아서 더 용기가 나는 글이네요…!!! ',
      createdAt: '2026-05-09T00:07:13.424+00:00',
      replies: [],
    },
    {
      id: 'abc5737c-57ce-4751-8d67-938e9a53ac98',
      author: PREVIEW_AUTHORS['pv-author-14'],
      body: "저도 가진 게 많을수록 잃을 게 많아 겁쟁이가 될 것 같았는데 범근 님 글을 읽고 다시 생각하게 되네요!\n'용기'까진 아니지만 생각해 보니 내 가족에게 더 좋은 사람이 되고 싶어서 늘 애쓰는 것 같아요.\n\n그나저나 가족 독서모임이라니... 멋있다...!",
      createdAt: '2026-05-09T04:42:39.242+00:00',
      replies: [],
    },
  ],
};
