import type { PreviewPostContent } from '../previewTypes';
import { PREVIEW_AUTHORS } from '../previewAuthors';

/** 살면서 제일 잘한 선택 (2026-05-29) */
export const post: PreviewPostContent = {
  id: '187a9596-4641-4e06-abf2-5f4835d1676f',
  title: '살면서 제일 잘한 선택',
  body: "<p>나는 '동경'이라는 감정을 괴로워한다. 즐겁지 않다. 부럽고 열등감이 든다. 그래서 무언가에 대해 동경을 느끼는 걸 스스로 인식하면 일부러 그걸 빨리 경험해버리려고 한다. 그 중 일등이 워홀이었다. 나는 낯선 땅에서 적응하고 섞여들 자신이 없는데 그게 멋있어 보여서 마음이 불편했다. 그래서 캐나다에 갔다.</p><p>사람도 문화도 시스템도 모르는 곳에서 살 집을 구하고 일하고 먹고 입었다. 능숙하지 않은 언어로 데이트를 하고 옆집 할머니와 인사를 하고 독서모임에 나갔다. 처음 할 땐 부담스럽고 긴장이 됐지만 어쨌든 다 가능했다. 할 수 있었다.</p><p>할 수 있구나! 할 수 있을지 걱정되는 것도 하면 할 수 있구나. 두려웠던 이곳에서 생존할 수 있다는 걸, 심지어 친구도 만들 수 있다는 걸 알았을 때 마음 한 곳이 시원하게 뚫렸다. 워홀뿐만 아니라 내가 동경하던 대부분의 것들을 더 이상 동경하지 않아도 됐다. 하면 되니까.</p><p></p><p>현지인과 영어로 소통하는 경험이 쌓이면서 영어 실력 자체도 조금 늘었지만 무엇보다 영어로 말하는 태도가 많이 늘었다. 스몰톡을 즐길 수 있게 됐다. 단어를 모르겠으면 대충 설명하거나 바로 사전 검색해서 말하고, 발음을 모르겠으면 그냥 대충 말하고 나 이거 발음 모르겠다고 했다. 그래도 된다고 느끼게 해준 존과 가브리엘과 한에게 막간 감사를 전한다.</p><p>그 상태로 여행을 하니까 세 배쯤 더 재밌었다. 다른 여행자들과 대화할 수 있으니까 혼자 다녀도 외롭지 않았다. 내 입맛대로 일정을 짜고 내 체력만큼 돌아다니면서 동시에 어떤 활동을 할 땐 다른 사람과 함께 즐기는 기분을 낼 수 있어 이득이었다. 내가 소통할 수 있는 대상이, 내가 활동할 수 있는 무대가 오랫동안 한국 안에만 있었는데 그게 넓어지는 경험을 했다.</p><p></p><p>그 경험의 핵심은 결국 더 커진 자유였다. 당연히 부자유보단 자유가 좋다고 생각했지만 세상 그 수많은 가치 중에서 나한테 제일 중요한 가치에 자유가 들어가는 줄은 잘 몰랐다. 해외살이를 통해 자유가 얼마나 나를 나답게 하는지, 삶의 어느 시기엔가 경험했던 부자유가 얼마나 내 내면적 불행의 원인이었는지 알게 됐다.</p><p></p><p>내 세상을 넓혀준 토론토와 토론토 친구들이 고맙다. 서울 외에 그리워할 수 있는 곳이 생겨서 좋다. 내년 여름엔 토론토에 가야지, 니카라과 식당에서 점심 먹고 맨날 가던 공원에 앉아서 메밀 아이스크림 먹어야지.</p>",
  contentPreview:
    "나는 '동경'이라는 감정을 괴로워한다. 즐겁지 않다. 부럽고 열등감이 든다. 그래서 무언가에 대해 동경을 느끼는 걸 스스로 인식하면 일부러 그걸 빨리 경험해버리려고 한다. 그 중 일등이 워홀이었다. 나는 낯선 땅에서 적응하고 섞여들 자신이 없는데 그게 멋있어 보여서 마음이 불편했다. 그래서 캐나다에 갔다. 사람도 문화도 시스템도 모르는 곳에서 살 집을",
  author: PREVIEW_AUTHORS['pv-author-27'],
  createdAt: '2026-05-29T14:59:37.876+00:00',
  thumbnailImageURL: null,
  weekDaysFromFirstDay: null,
  comments: [
    {
      id: '2474152c-353d-441c-be13-e5f78b7cfd51',
      author: PREVIEW_AUTHORS['pv-author-19'],
      body: '> 무언가에 대해 동경을 느끼는 걸 스스로 인식하면 일부러 그걸 빨리 경험해버리려고 한다.\n괴로움에서 시작됐지만 실행력이 엄청난데요. ',
      createdAt: '2026-05-29T15:24:27.685+00:00',
      replies: [
        {
          id: '3b1f748c-73a7-4262-aef4-87e853e9b5d7',
          author: PREVIEW_AUTHORS['pv-author-27'],
          body: '실행력 원툴로 살아가고 있습니다ㅋㅎ',
          createdAt: '2026-05-30T09:53:57.773+00:00',
        },
      ],
    },
    {
      id: 'a855a641-eb9b-446c-bf7a-2f244269ba33',
      author: PREVIEW_AUTHORS['pv-author-3'],
      body: '얼룩룩님의 워홀이 이런 마음에서 시작된거라니 넘 신기하고 대단해요!! ㅋㅋㅋ 게다가 엄청 재밌고 알차게 경험하고 오신 것 같아 부럽군요. ',
      createdAt: '2026-05-29T19:14:28.226+00:00',
      replies: [
        {
          id: '6e3fbd1d-6c55-4a2e-af1f-83b2e4762b8f',
          author: PREVIEW_AUTHORS['pv-author-27'],
          body: 'ㅋㅋㅋ감사합니다. 그러고 보니 왜 갔는지에 대해서 처음 쓴 것 같네요.',
          createdAt: '2026-05-30T09:54:22.222+00:00',
        },
      ],
    },
    {
      id: 'b1675179-8d8b-4852-bcaf-34e5996be64c',
      author: PREVIEW_AUTHORS['pv-author-5'],
      body: "> 할 수 있구나! 할 수 있을지 걱정되는 것도 하면 할 수 있구나. 두려웠던 이곳에서 생존할 수 있다는 걸, 심지어 친구도 만들 수 있다는 걸 알았을 때 마음 한 곳이 시원하게 뚫렸다. 워홀뿐만 아니라 내가 동경하던 대부분의 것들을 더 이상 동경하지 않아도 됐다. 하면 되니까.\n\n>자유가 얼마나 나를 나답게 하는지, 삶의 어느 시기엔가 경험했던 부자유가 얼마나 내 내면적 불행의 원인이었는지 알게 됐다.\n\n넘 멋있고 공감되는 부분이에요!! 얼룩룩님 글 덕분에 다시 한번 '하면 된다!' 라는 용기를 맘 속에 새기게 되네요. 좋은 글 써주셔서 감사함다~! 좋은 주말 되세요! \n",
      createdAt: '2026-05-30T02:19:53.35+00:00',
      replies: [
        {
          id: 'c4e29b64-9cdd-410b-bb9a-2e035bf9cd89',
          author: PREVIEW_AUTHORS['pv-author-27'],
          body: '일단 하면 잘은 안 될 수 있어도 뭔가 발생하긴 한다는 마음으로..!! 감사합니다 화이팅입니다',
          createdAt: '2026-05-30T09:56:13.44+00:00',
        },
      ],
    },
    {
      id: '7dda7bdb-fab0-4a02-bfea-adcd0348c2aa',
      author: PREVIEW_AUTHORS['pv-author-11'],
      body: '>처음 할 땐 부담스럽고 긴장이 됐지만 어쨌든 다 가능했다. 할 수 있었다.\n 와 멋지고 대단해요',
      createdAt: '2026-05-30T04:01:33.538+00:00',
      replies: [
        {
          id: '80908cb2-0d6d-4809-b876-2fad53f25c9b',
          author: PREVIEW_AUTHORS['pv-author-27'],
          body: '그렇게 봐주셔서 감사합니다.',
          createdAt: '2026-05-30T09:58:36.643+00:00',
        },
      ],
    },
  ],
};
